data/00_cases/lidcavity/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{	
	//inlet
	//{
	//	type            codedFixedValue;
	//	value           uniform (0 0 0); // fallback, required but ignored
	//
	//	name    		coded;
	//
	//	code
	//	#{
	//		const vectorField& C = patch().Cf(); // face centers
	//		vectorField& field = *this;
	//		forAll(field, i)
	//		{
	//			scalar x = C[i].x();         // X-coordinate of face center
	//			field[i] = vector(pow(1 - pow(2*x-1, 18), 2), 0, 0);
	//		}
	//	#};
	//}

    lid
    {
        type            fixedValue;
        value           uniform (1 0 0);
    }

    walls
    {
        type            noSlip;
    }

    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
